massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
/*
 * ESP32C6 Matter over Thread - 4 Inputs + 2 Outputs + SCD40 Sensor + Antenna Control
 * Based on ESP-Matter examples
 *
 * GPIO Configuration:
 * - Inputs: GPIO 0, 1, 2, 21 (Contact Sensors - Independent)
 * - Outputs: GPIO 19, 20 (On/Off Lights - Independent)
 * - I2C: GPIO 22 (SDA), GPIO 23 (SCL) - SCD40 Sensor (0x62)
 * - Status LED: GPIO 15 (Thread Role Indicator)
 *   * Solid ON: End Device (no routing)
 *   * Single blink (1x): Router (routing enabled)
 *   * Double blink (2x): Leader (routing + network leader)
 *   * OFF: Disconnected/Disabled
 *
 * SCD40 Sensor (Sensirion CO2/Temperature/Humidity):
 * - I2C Address: 0x62
 * - Measurements: CO2 (ppm), Temperature (°C), Humidity (%RH)
 * - Published via Matter clusters
 *
 * XIAO ESP32C6 Antenna Control:
 * - GPIO 3: RF switch enable (LOW to activate)
 * - GPIO 14: Antenna selection (LOW=internal, HIGH=external)
 * - Matter Control: Virtual On/Off endpoint (ON=External, OFF=Internal)
 */

#include <esp_err.h>
#include <esp_log.h>
#include <nvs_flash.h>
#include <nvs.h>
#include <string.h>

#include <esp_matter.h>
#include <esp_matter_core.h>
#include <esp_matter_endpoint.h>
#include <esp_matter_attribute_utils.h>

#include <app/clusters/air-quality-server/air-quality-server.h>
#include <app/clusters/boolean-state-server/boolean-state-cluster.h>
#include <data_model_provider/clusters/boolean_state_integration.h>
#include <app/EventLogging.h>
#include <app-common/zap-generated/cluster-objects.h>
#include <platform/CHIPDeviceLayer.h>

#include <app_priv.h>
#include <app_reset.h>
#include <driver/gpio.h>
#include <driver/i2c_master.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
#include <platform/ESP32/OpenthreadLauncher.h>
#include <common/Esp32ThreadInit.h>
#include <openthread/instance.h>
#include <openthread/thread.h>
#include <openthread/thread_ftd.h>
#include <openthread/netdata.h>
#include <esp_openthread.h>
#endif

#include <setup_payload/OnboardingCodesUtil.h>
#include <platform/CHIPDeviceLayer.h>
#include <platform/ESP32/ESP32Config.h>

// OLED Display
#include "oled_display.h"

// Time functions
#include <time.h>
#include <sys/time.h>

// SNTP for time synchronization
#include <esp_sntp.h>
#include <esp_netif_sntp.h>

// DNS and network diagnostics
#include <lwip/dns.h>
#include <lwip/netdb.h>
#include <lwip/sockets.h>

static const char *TAG = "app_main";

// OLED display available flag
static bool oled_available = false;

// GPIO Definitions for ESP32C6
// 4 Inputs
#define GPIO_INPUT_0  GPIO_NUM_0   // Input 1
#define GPIO_INPUT_1  GPIO_NUM_1   // Input 2
#define GPIO_INPUT_2  GPIO_NUM_2   // Input 3
#define GPIO_INPUT_3  GPIO_NUM_21  // Input 4

// 2 Outputs (GPIO22 and GPIO23 now used for I2C)
#define GPIO_OUTPUT_0 GPIO_NUM_19  // Output 1
#define GPIO_OUTPUT_1 GPIO_NUM_20  // Output 2

// I2C for SCD40 Sensor
#define I2C_MASTER_SCL_IO GPIO_NUM_23  // I2C SCL
#define I2C_MASTER_SDA_IO GPIO_NUM_22  // I2C SDA
#define I2C_MASTER_NUM I2C_NUM_0       // I2C port number
#define I2C_MASTER_FREQ_HZ 100000      // I2C clock frequency
#define SCD40_I2C_ADDR 0x62            // SCD40 I2C address

// XIAO ESP32C6 Status LED
#define GPIO_STATUS_LED       GPIO_NUM_15  // USER LED - Thread role indicator

// XIAO ESP32C6 Antenna Configuration
// Set to 1 for external antenna (UFL connector), 0 for internal ceramic antenna
#define USE_EXTERNAL_ANTENNA  0

// Antenna control GPIOs (XIAO ESP32C6 specific)
#define GPIO_WIFI_ENABLE      GPIO_NUM_3   // RF switch enable (must be LOW)
#define GPIO_WIFI_ANT_CONFIG  GPIO_NUM_14  // Antenna selection: LOW=internal, HIGH=external
// Note: Try GPIO14 (official docs), GPIO15, or GPIO16 if GPIO18 doesn't work

using namespace esp_matter;
using namespace esp_matter::attribute;
using namespace esp_matter::endpoint;
using namespace chip::app::Clusters;

// Forward declare Air Quality Instance pointer
static chip::app::Clusters::AirQuality::Instance * gAirQualityInstance = nullptr;

// Boot initialization flag - prevents Matter from overwriting EEPROM values during startup
static bool device_initialization_complete = false;

// SCD40 configuration loaded from EEPROM at boot - used for OpenHAB sync
static uint16_t loaded_altitude_meters = 0;
static float loaded_temp_offset_celsius = 4.0f;

// Endpoint IDs for 2 outputs
static uint16_t output_endpoint_ids[2] = {0, 0};

// Endpoint IDs for 4 inputs
static uint16_t input_endpoint_ids[4] = {0, 0, 0, 0};

// Endpoint IDs for SCD40 sensor
static uint16_t air_quality_endpoint_id = 0;  // Air Quality enum (calculated from CO2)
static uint16_t co2_endpoint_id = 0;           // CO2 concentration in PPM
static uint16_t temperature_endpoint_id = 0;
static uint16_t humidity_endpoint_id = 0;

// Previous sensor values for change detection (reduce unnecessary reports)
static uint16_t last_reported_co2 = 0;
static int16_t last_reported_temp = 0;      // in centidegrees (°C * 100)
static uint16_t last_reported_humidity = 0; // in centipercent (%RH * 100)
static uint8_t last_reported_air_quality = 0;

// Thresholds for reporting changes (avoid flooding network with small changes)
#define CO2_REPORT_THRESHOLD 20        // Report if CO2 changes by more than 20 ppm
#define TEMP_REPORT_THRESHOLD 10       // Report if temp changes by more than 0.1°C (10 centidegrees)
#define HUMIDITY_REPORT_THRESHOLD 50   // Report if humidity changes by more than 0.5% (50 centipercent)

// Endpoint IDs for SCD40 control (virtual switches for OpenHAB)
static uint16_t scd40_calibrate_endpoint_id = 0;     // Trigger forced calibration
static uint16_t scd40_asc_enable_endpoint_id = 0;    // Enable/disable ASC
static uint16_t scd40_low_power_endpoint_id = 0;     // Switch to low power mode
static uint16_t scd40_persist_endpoint_id = 0;       // Trigger persist settings
static uint16_t scd40_self_test_endpoint_id = 0;     // Trigger self test
static uint16_t scd40_altitude_endpoint_id = 0;      // Set altitude (level control)
static uint16_t scd40_temp_offset_endpoint_id = 0;   // Set temperature offset (level control)

// SNTP configuration
static bool sntp_initialized = false;
static bool sntp_time_synced = false;

// Local NTP server IPv6 address (only internal NTP server is used)
// This is the Raspberry Pi/Home Assistant IPv6 address reachable from Thread network
// Change this to match your local NTP server's IPv6 address
#ifndef CONFIG_LOCAL_NTP_SERVER_IPV6
#define CONFIG_LOCAL_NTP_SERVER_IPV6 "fddd:9cf8:e546:0:99b0:6203:5f44:6e2d"
#endif

