massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
// GPIO pins arrays
static const gpio_num_t input_pins[4] = {GPIO_INPUT_0, GPIO_INPUT_1, GPIO_INPUT_2, GPIO_INPUT_3};
static const gpio_num_t output_pins[2] = {GPIO_OUTPUT_0, GPIO_OUTPUT_1};

// SCD40 sensor data
// Written by scd40_sensor_task, read by display_rotation_task: protected by
// scd40_data_mutex since float writes are not guaranteed atomic on this core.
static uint16_t scd40_co2 = 0;        // CO2 in ppm
static float scd40_temperature = 0.0;  // Temperature in °C
static float scd40_humidity = 0.0;     // Humidity in %RH
static bool scd40_available = false;  // Flag to track if sensor is available
static SemaphoreHandle_t scd40_data_mutex = NULL;  // Guards the three fields above

// I2C handles (new API)
static i2c_master_bus_handle_t i2c_bus_handle = NULL;
static i2c_master_dev_handle_t scd40_dev_handle = NULL;

// I2C error recovery
static int scd40_consecutive_errors = 0;
#define SCD40_MAX_ERRORS_BEFORE_REINIT 3  // Reinit after 3 consecutive errors

// Helper function to calculate Air Quality from CO2 level
// Based on indoor air quality standards
static uint8_t calculate_air_quality_from_co2(uint16_t co2_ppm) {
    // AirQualityEnum values:
    // 0x00 = Unknown, 0x01 = Good, 0x02 = Fair, 0x03 = Moderate
    // 0x04 = Poor, 0x05 = VeryPoor, 0x06 = ExtremelyPoor

    if (co2_ppm < 800) {
        return 0x01;  // Good
    } else if (co2_ppm < 1000) {
        return 0x02;  // Fair
    } else if (co2_ppm < 1500) {
        return 0x03;  // Moderate
    } else if (co2_ppm < 2000) {
        return 0x04;  // Poor
    } else if (co2_ppm < 5000) {
        return 0x05;  // VeryPoor
    } else {
        return 0x06;  // ExtremelyPoor
    }
}

// SCD40 commands (Sensirion SCD40 datasheet)
// Basic Commands
#define SCD40_CMD_START_PERIODIC_MEASUREMENT  0x21b1
#define SCD40_CMD_READ_MEASUREMENT            0xec05
#define SCD40_CMD_STOP_PERIODIC_MEASUREMENT   0x3f86

// On-chip output signal compensation
#define SCD40_CMD_SET_TEMPERATURE_OFFSET      0x241d
#define SCD40_CMD_GET_TEMPERATURE_OFFSET      0x2318
#define SCD40_CMD_SET_SENSOR_ALTITUDE         0x2427
#define SCD40_CMD_GET_SENSOR_ALTITUDE         0x2322
#define SCD40_CMD_SET_AMBIENT_PRESSURE        0xe000

// Field calibration
#define SCD40_CMD_PERFORM_FORCED_RECALIBRATION           0x362f
#define SCD40_CMD_SET_AUTOMATIC_SELF_CALIBRATION_ENABLED 0x2416
#define SCD40_CMD_GET_AUTOMATIC_SELF_CALIBRATION_ENABLED 0x2313

// Low power
#define SCD40_CMD_START_LOW_POWER_PERIODIC_MEASUREMENT   0x21ac
#define SCD40_CMD_GET_DATA_READY_STATUS                  0xe4b8

// Advanced features
#define SCD40_CMD_PERSIST_SETTINGS            0x3615
#define SCD40_CMD_GET_SERIAL_NUMBER           0x3682
#define SCD40_CMD_PERFORM_SELF_TEST           0x3639
#define SCD40_CMD_PERFORM_FACTORY_RESET       0x3632
#define SCD40_CMD_REINIT                      0x3646

// Low power single shot (SCD41 only)
#define SCD40_CMD_MEASURE_SINGLE_SHOT         0x219d
#define SCD40_CMD_MEASURE_SINGLE_SHOT_RHT_ONLY 0x2196

// Forward declarations
static esp_err_t scd40_init(void);

// Initialize I2C master (new API)
static esp_err_t i2c_master_init(void)
{
    // Configure I2C master bus
    i2c_master_bus_config_t bus_config = {
        .i2c_port = I2C_MASTER_NUM,
        .sda_io_num = I2C_MASTER_SDA_IO,
        .scl_io_num = I2C_MASTER_SCL_IO,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags = {
            .enable_internal_pullup = true,
        },
    };

    esp_err_t err = i2c_new_master_bus(&bus_config, &i2c_bus_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "I2C master bus creation failed: %s", esp_err_to_name(err));
        return err;
    }

    // Add SCD40 device to the bus
    i2c_device_config_t dev_config = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = SCD40_I2C_ADDR,
        .scl_speed_hz = I2C_MASTER_FREQ_HZ,
    };

    err = i2c_master_bus_add_device(i2c_bus_handle, &dev_config, &scd40_dev_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to add SCD40 device to I2C bus: %s", esp_err_to_name(err));
        return err;
    }

    ESP_LOGI(TAG, "I2C initialized: SDA=GPIO%d, SCL=GPIO%d", I2C_MASTER_SDA_IO, I2C_MASTER_SCL_IO);
    return ESP_OK;
}

// Reinitialize I2C bus and all I2C devices (for error recovery)
static esp_err_t i2c_bus_reinit(void)
{
    ESP_LOGW(TAG, "Attempting I2C bus reinitialization (all devices)...");

    // Step 1: Remove SCD40 device from bus (if exists)
    if (scd40_dev_handle != NULL) {
        esp_err_t err = i2c_master_bus_rm_device(scd40_dev_handle);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to remove SCD40 device: %s (continuing anyway)", esp_err_to_name(err));
        }
        scd40_dev_handle = NULL;
    }

    // Step 2: Deinitialize OLED (destroys its I2C device handle)
    // Note: oled_deinit() only removes the device, not the bus (owns_bus=false)
    if (oled_available) {
        oled_deinit();
    }

    // Step 3: Delete I2C master bus (if exists)
    if (i2c_bus_handle != NULL) {
        esp_err_t err = i2c_del_master_bus(i2c_bus_handle);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to delete I2C bus: %s (continuing anyway)", esp_err_to_name(err));
        }
        i2c_bus_handle = NULL;
    }

    // Step 4: Small delay to let hardware settle
    vTaskDelay(pdMS_TO_TICKS(100));

    // Step 5: Reinitialize I2C master bus
    esp_err_t err = i2c_master_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "I2C bus reinitialization failed: %s", esp_err_to_name(err));
        return err;
    }

    // Step 6: Reinitialize SCD40 sensor
    err = scd40_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SCD40 reinitialization failed: %s", esp_err_to_name(err));
        // Continue to try OLED anyway
    } else {
        ESP_LOGI(TAG, "SCD40 reinitialized successfully");
    }

    // Step 7: Reinitialize OLED display with new bus
    if (oled_available) {
        err = oled_reinit(i2c_bus_handle);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "OLED reinitialization failed: %s", esp_err_to_name(err));
            oled_available = false;
        } else {
            ESP_LOGI(TAG, "OLED reinitialized successfully");
        }
    }

    ESP_LOGI(TAG, "I2C bus reinitialization complete!");
    return ESP_OK;
}

