massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
// Send command to SCD40
esp_err_t scd40_send_command(uint16_t command)
{
    if (scd40_dev_handle == NULL) {
        ESP_LOGE(TAG, "SCD40 command 0x%04x failed: I2C handle is NULL (not initialized or corrupted)", command);
        return ESP_ERR_INVALID_STATE;
    }

    uint8_t cmd_buf[2];
    cmd_buf[0] = (command >> 8) & 0xFF;
    cmd_buf[1] = command & 0xFF;

    esp_err_t err = i2c_master_transmit(scd40_dev_handle, cmd_buf, 2, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SCD40 command 0x%04x failed: %s", command, esp_err_to_name(err));
    }
    return err;
}

// Read data from SCD40 with CRC check (Sensirion CRC-8)
static uint8_t scd40_crc8(const uint8_t *data, size_t len)
{
    uint8_t crc = 0xFF;
    for (size_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (uint8_t bit = 0; bit < 8; bit++) {
            if (crc & 0x80) {
                crc = (crc << 1) ^ 0x31;
            } else {
                crc = crc << 1;
            }
        }
    }
    return crc;
}

// Initialize SCD40 sensor
static esp_err_t scd40_init(void)
{
    ESP_LOGI(TAG, "Initializing SCD40 sensor...");

    // Stop any ongoing measurement
    scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
    vTaskDelay(pdMS_TO_TICKS(500));

    // Start periodic measurement
    esp_err_t err = scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start SCD40 periodic measurement");
        return err;
    }

    ESP_LOGI(TAG, "SCD40 periodic measurement started (readings every 5 seconds)");
    return ESP_OK;
}

// Read measurement from SCD40
static esp_err_t scd40_read_measurement(uint16_t *co2, float *temperature, float *humidity)
{
    if (scd40_dev_handle == NULL) {
        ESP_LOGE(TAG, "scd40_read_measurement failed: I2C handle is NULL");
        return ESP_ERR_INVALID_STATE;
    }

    uint8_t data[9];  // 3 words of 2 bytes + 1 CRC byte each

    // Send read command
    esp_err_t err = scd40_send_command(SCD40_CMD_READ_MEASUREMENT);
    if (err != ESP_OK) {
        return err;
    }

    // Wait for measurement to be ready (1ms should be enough)
    vTaskDelay(pdMS_TO_TICKS(1));

    // Read 9 bytes (3x [2 data bytes + 1 CRC])
    err = i2c_master_receive(scd40_dev_handle, data, 9, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to read SCD40 data: %s", esp_err_to_name(err));
        return err;
    }

    // Verify CRC for each word
    if (scd40_crc8(&data[0], 2) != data[2]) {
        ESP_LOGE(TAG, "SCD40 CRC error for CO2");
        return ESP_ERR_INVALID_CRC;
    }
    if (scd40_crc8(&data[3], 2) != data[5]) {
        ESP_LOGE(TAG, "SCD40 CRC error for temperature");
        return ESP_ERR_INVALID_CRC;
    }
    if (scd40_crc8(&data[6], 2) != data[8]) {
        ESP_LOGE(TAG, "SCD40 CRC error for humidity");
        return ESP_ERR_INVALID_CRC;
    }

    // Parse data
    *co2 = (data[0] << 8) | data[1];
    uint16_t temp_raw = (data[3] << 8) | data[4];
    uint16_t hum_raw = (data[6] << 8) | data[7];

    // Convert to physical values (from SCD40 datasheet)
    *temperature = -45.0f + 175.0f * ((float)temp_raw / 65535.0f);
    *humidity = 100.0f * ((float)hum_raw / 65535.0f);

    return ESP_OK;
}

// ============================================================================
// ADDITIONAL SCD40 COMMANDS - Full API Implementation
// ============================================================================

// Helper function: Send command with data word (16-bit) and CRC
static esp_err_t scd40_send_command_with_data(uint16_t command, uint16_t data)
{
    if (scd40_dev_handle == NULL) {
        ESP_LOGE(TAG, "SCD40 command with data 0x%04x failed: I2C handle is NULL", command);
        return ESP_ERR_INVALID_STATE;
    }

    uint8_t cmd_buf[5];
    uint8_t data_bytes[2];

    // Command bytes
    cmd_buf[0] = (command >> 8) & 0xFF;
    cmd_buf[1] = command & 0xFF;

    // Data bytes
    data_bytes[0] = (data >> 8) & 0xFF;
    data_bytes[1] = data & 0xFF;
    cmd_buf[2] = data_bytes[0];
    cmd_buf[3] = data_bytes[1];

    // CRC for data
    cmd_buf[4] = scd40_crc8(data_bytes, 2);

    esp_err_t err = i2c_master_transmit(scd40_dev_handle, cmd_buf, 5, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SCD40 command with data 0x%04x failed: %s", command, esp_err_to_name(err));
    }
    return err;
}

/// Helper function: Read single word (16-bit) with CRC verification
static esp_err_t scd40_read_word(uint16_t *value)
{
    if (scd40_dev_handle == NULL) {
        ESP_LOGE(TAG, "scd40_read_word failed: I2C handle is NULL");
        return ESP_ERR_INVALID_STATE;
    }

    uint8_t data[3]; // 2 bytes data + 1 byte CRC

    esp_err_t err = i2c_master_receive(scd40_dev_handle, data, 3, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to read word from SCD40: %s", esp_err_to_name(err));
        return err;
    }

    // Verify CRC
    if (scd40_crc8(&data[0], 2) != data[2]) {
        ESP_LOGE(TAG, "SCD40 CRC error reading word");
        return ESP_ERR_INVALID_CRC;
    }

    *value = (data[0] << 8) | data[1];
    return ESP_OK;
}

// ============================================================================
// ON-CHIP OUTPUT SIGNAL COMPENSATION COMMANDS
// ============================================================================

// Set temperature offset (in °C)
// Temperature offset has no influence on SCD40 CO2 accuracy
// Default offset is 4°C
esp_err_t scd40_set_temperature_offset(float offset_celsius)
{
    // Convert °C to raw value: raw = (offset * 2^16) / 175
    uint16_t offset_raw = (uint16_t)((offset_celsius * 65536.0f) / 175.0f);

    ESP_LOGI(TAG, "Setting SCD40 temperature offset: %.2f°C (raw: 0x%04x)", offset_celsius, offset_raw);
    return scd40_send_command_with_data(SCD40_CMD_SET_TEMPERATURE_OFFSET, offset_raw);
}

// Get temperature offset (in °C)
esp_err_t scd40_get_temperature_offset(float *offset_celsius)
{
    esp_err_t err = scd40_send_command(SCD40_CMD_GET_TEMPERATURE_OFFSET);
    if (err != ESP_OK) return err;

    vTaskDelay(pdMS_TO_TICKS(1));

