massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
#define NVS_NAMESPACE "scd40_cfg"
#define NVS_KEY_ALTITUDE "altitude"
#define NVS_KEY_TEMP_OFFSET "temp_offset"

// Save altitude to NVS
static esp_err_t nvs_save_altitude(uint16_t altitude)
{
    nvs_handle_t handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "NVS: Failed to open namespace '%s' for writing altitude: %s", NVS_NAMESPACE, esp_err_to_name(err));
        return err;
    }

    err = nvs_set_u16(handle, NVS_KEY_ALTITUDE, altitude);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "NVS: Failed to set altitude value: %s", esp_err_to_name(err));
        nvs_close(handle);
        return err;
    }

    err = nvs_commit(handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "NVS: Failed to commit altitude: %s", esp_err_to_name(err));
        nvs_close(handle);
        return err;
    }

    ESP_LOGI(TAG, "NVS: ✓ Saved altitude %u meters (handle=0x%lx)", altitude, (unsigned long)handle);
    nvs_close(handle);
    return ESP_OK;
}

// Load altitude from NVS
static esp_err_t nvs_load_altitude(uint16_t *altitude)
{
    nvs_handle_t handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return err;  // Not found or error
    }

    err = nvs_get_u16(handle, NVS_KEY_ALTITUDE, altitude);
    nvs_close(handle);

    if (err == ESP_OK) {
        ESP_LOGI(TAG, "NVS: Loaded altitude %u meters", *altitude);
    }
    return err;
}

// Save temperature offset to NVS (stored as int16_t in centesimi: 4.5°C = 450)
static esp_err_t nvs_save_temp_offset(float offset_celsius)
{
    nvs_handle_t handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "NVS: Failed to open namespace '%s' for writing temp offset: %s", NVS_NAMESPACE, esp_err_to_name(err));
        return err;
    }

    // Convert float to int16_t centesimi (4.5°C → 450)
    int16_t offset_centesimi = (int16_t)(offset_celsius * 100.0f);

    err = nvs_set_i16(handle, NVS_KEY_TEMP_OFFSET, offset_centesimi);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "NVS: Failed to set temp offset value: %s", esp_err_to_name(err));
        nvs_close(handle);
        return err;
    }

    err = nvs_commit(handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "NVS: Failed to commit temp offset: %s", esp_err_to_name(err));
        nvs_close(handle);
        return err;
    }

    ESP_LOGI(TAG, "NVS: ✓ Saved temp offset %.2f°C (%d centesimi, handle=0x%lx)", offset_celsius, offset_centesimi, (unsigned long)handle);
    nvs_close(handle);
    return ESP_OK;
}

// Load temperature offset from NVS
static esp_err_t nvs_load_temp_offset(float *offset_celsius)
{
    nvs_handle_t handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return err;  // Not found or error
    }

    int16_t offset_centesimi;
    err = nvs_get_i16(handle, NVS_KEY_TEMP_OFFSET, &offset_centesimi);
    nvs_close(handle);

    if (err == ESP_OK) {
        *offset_celsius = offset_centesimi / 100.0f;
        ESP_LOGI(TAG, "NVS: Loaded temp offset %.2f°C (%d centesimi)", *offset_celsius, offset_centesimi);
    }
    return err;
}

// Erase SCD40 configuration from NVS (used during factory reset)
esp_err_t nvs_erase_scd40_config(void)
{
    nvs_handle_t handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "NVS: Namespace %s not found during erase (already clean)", NVS_NAMESPACE);
        return ESP_OK;  // If namespace doesn't exist, consider it already erased
    }

    // Erase entire namespace
    err = nvs_erase_all(handle);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "NVS: Erased all SCD40 configuration (altitude, temp offset)");
        } else {
            ESP_LOGE(TAG, "NVS: Failed to commit erase: %s", esp_err_to_name(err));
        }
    } else {
        ESP_LOGE(TAG, "NVS: Failed to erase namespace: %s", esp_err_to_name(err));
    }

    nvs_close(handle);
    return err;
}

// Event callback
static void app_event_cb(const ChipDeviceEvent *event, intptr_t arg)
{
    switch (event->Type) {
    case chip::DeviceLayer::DeviceEventType::kInterfaceIpAddressChanged:
        ESP_LOGI(TAG, "Interface IP Address changed");
        // Trigger NTP resync when IP address changes (network may now be available)
        if (sntp_initialized && !sntp_time_synced) {
            ESP_LOGI(TAG, "Triggering NTP resync after IP address change");
            esp_sntp_stop();
            esp_sntp_init();
        }
        break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningComplete:
        ESP_LOGI(TAG, "Commissioning complete");
        break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningWindowOpened:
        ESP_LOGI(TAG, "Commissioning window opened");
        break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningWindowClosed:
        ESP_LOGI(TAG, "Commissioning window closed");
        break;
    case chip::DeviceLayer::DeviceEventType::kThreadStateChange:
        ESP_LOGI(TAG, "Thread state changed");
        break;
    case chip::DeviceLayer::DeviceEventType::kThreadConnectivityChange:
        ESP_LOGI(TAG, "Thread connectivity changed");
        // Trigger NTP resync when Thread connectivity changes
        // This ensures time sync happens after Thread network is available
        if (sntp_initialized && !sntp_time_synced) {
            ESP_LOGI(TAG, "Triggering NTP resync after Thread connectivity change");
            esp_sntp_stop();
            esp_sntp_init();
        }
        break;
    case chip::DeviceLayer::DeviceEventType::kCHIPoBLEConnectionEstablished:
        ESP_LOGI(TAG, "CHIPoBLE connection established");
        break;
    case chip::DeviceLayer::DeviceEventType::kCHIPoBLEConnectionClosed:
        ESP_LOGI(TAG, "CHIPoBLE connection closed");
        break;
    default:
        ESP_LOGD(TAG, "Event type: %d", event->Type);
        break;
    }
}

// ==============================================================================
// SNTP Time Synchronization
// ==============================================================================

// SNTP time sync callback
static void sntp_sync_time_cb(struct timeval *tv) {
    sntp_time_synced = true;

    time_t now = tv->tv_sec;
    struct tm timeinfo;
    localtime_r(&now, &timeinfo);

    ESP_LOGI(TAG, "SNTP: Time synchronized! %04d-%02d-%02d %02d:%02d:%02d",
             timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday,
             timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
}

