massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
// Initialize SNTP with local NTP server only
static void sntp_init_local(void) {
    const char* local_ntp = CONFIG_LOCAL_NTP_SERVER_IPV6;

    ESP_LOGI(TAG, "SNTP: Initializing with local NTP server: %s", local_ntp);

    // Set timezone to Europe/Rome (CET-1CEST,M3.5.0,M10.5.0/3)
    // CET = Central European Time (UTC+1)
    // CEST = Central European Summer Time (UTC+2)
    // M3.5.0 = DST starts last Sunday of March at 2:00
    // M10.5.0/3 = DST ends last Sunday of October at 3:00
    setenv("TZ", "CET-1CEST,M3.5.0,M10.5.0/3", 1);
    tzset();

    if (sntp_initialized) {
        // Stop existing SNTP
        esp_sntp_stop();
    }

    // Configure SNTP
    esp_sntp_setoperatingmode(SNTP_OPMODE_POLL);

    // Use only local NTP server (IPv6 address reachable from Thread network)
    ESP_LOGI(TAG, "SNTP: Using LOCAL NTP server: %s", local_ntp);
    esp_sntp_setservername(0, local_ntp);

    esp_sntp_set_time_sync_notification_cb(sntp_sync_time_cb);
    esp_sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);

    // Start SNTP
    esp_sntp_init();
    sntp_initialized = true;

    ESP_LOGI(TAG, "SNTP: Started, waiting for time sync...");
}

// Get SNTP sync status string
static const char* sntp_sync_status_str(sntp_sync_status_t status) {
    switch (status) {
        case SNTP_SYNC_STATUS_RESET: return "RESET (waiting)";
        case SNTP_SYNC_STATUS_COMPLETED: return "COMPLETED";
        case SNTP_SYNC_STATUS_IN_PROGRESS: return "IN_PROGRESS";
        default: return "UNKNOWN";
    }
}

// Log Thread network info
static void log_thread_network_info(void) {
#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    otInstance *ot_instance = esp_openthread_get_instance();
    if (!ot_instance) {
        ESP_LOGE(TAG, "Thread: No OpenThread instance");
        return;
    }

    ESP_LOGW(TAG, "Thread Network Info:");

    // Device role
    otDeviceRole role = otThreadGetDeviceRole(ot_instance);
    const char* role_str = "Unknown";
    switch(role) {
        case OT_DEVICE_ROLE_DISABLED: role_str = "Disabled"; break;
        case OT_DEVICE_ROLE_DETACHED: role_str = "Detached"; break;
        case OT_DEVICE_ROLE_CHILD: role_str = "Child"; break;
        case OT_DEVICE_ROLE_ROUTER: role_str = "Router"; break;
        case OT_DEVICE_ROLE_LEADER: role_str = "Leader"; break;
    }
    ESP_LOGW(TAG, "  Role: %s", role_str);

    // Get mesh-local addresses
    const otNetifAddress *addr = otIp6GetUnicastAddresses(ot_instance);
    ESP_LOGW(TAG, "  IPv6 Addresses:");
    while (addr) {
        char addr_str[64];
        otIp6AddressToString(&addr->mAddress, addr_str, sizeof(addr_str));
        ESP_LOGW(TAG, "    %s", addr_str);
        addr = addr->mNext;
    }

    // Check if we have a border router
    otBorderRouterConfig config;
    otNetworkDataIterator iterator = OT_NETWORK_DATA_ITERATOR_INIT;
    bool has_border_router = false;
    ESP_LOGW(TAG, "  Border Routers in Network Data:");
    while (otNetDataGetNextOnMeshPrefix(ot_instance, &iterator, &config) == OT_ERROR_NONE) {
        has_border_router = true;
        char prefix_str[64];
        otIp6PrefixToString(&config.mPrefix, prefix_str, sizeof(prefix_str));
        ESP_LOGW(TAG, "    Prefix: %s (default:%d, slaac:%d, dhcp:%d, onMesh:%d)",
                 prefix_str,
                 config.mDefaultRoute ? 1 : 0,
                 config.mSlaac ? 1 : 0,
                 config.mDhcp ? 1 : 0,
                 config.mOnMesh ? 1 : 0);
    }
    if (!has_border_router) {
        ESP_LOGE(TAG, "    NO BORDER ROUTER PREFIX! Cannot reach Internet.");
    }
#endif
}

// SNTP monitoring task - periodically checks and retries sync with local server only
static void sntp_monitor_task(void *arg) {
    ESP_LOGI(TAG, "SNTP monitor task started (local server only: %s)", CONFIG_LOCAL_NTP_SERVER_IPV6);

    int retry_count = 0;
    const int MAX_RETRIES = 10;  // Maximum retries before extended wait

    // Wait for initial Thread connection
    vTaskDelay(pdMS_TO_TICKS(10000));

    while (1) {
        // Check current SNTP status
        sntp_sync_status_t status = sntp_get_sync_status();

        // Get current time to check if it's reasonable
        time_t now;
        struct tm timeinfo;
        time(&now);
        localtime_r(&now, &timeinfo);
        int year = timeinfo.tm_year + 1900;

        // Check if Thread is connected
        bool thread_connected = false;
#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
        otInstance *ot_instance = esp_openthread_get_instance();
        if (ot_instance) {
            otDeviceRole role = otThreadGetDeviceRole(ot_instance);
            thread_connected = (role >= OT_DEVICE_ROLE_CHILD);
        }
#endif

        if (sntp_time_synced && year >= 2020) {
            // Time is synced, just log periodically
            ESP_LOGI(TAG, "SNTP: Status=%s, Time=%04d-%02d-%02d %02d:%02d:%02d, Server=%s",
                     sntp_sync_status_str(status),
                     year, timeinfo.tm_mon + 1, timeinfo.tm_mday,
                     timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec,
                     CONFIG_LOCAL_NTP_SERVER_IPV6);
            retry_count = 0;  // Reset retry count on success
            // Check every 5 minutes once synced
            vTaskDelay(pdMS_TO_TICKS(300000));
        } else {
            // Not synced yet
            ESP_LOGW(TAG, "SNTP: NOT SYNCED - Status=%s, Year=%d, Thread=%s, Server=%s, Retry=%d",
                     sntp_sync_status_str(status),
                     year,
                     thread_connected ? "Connected" : "Disconnected",
                     CONFIG_LOCAL_NTP_SERVER_IPV6,
                     retry_count);

            if (thread_connected) {
                retry_count++;

                // Run network diagnostics on first retry
                if (retry_count == 1) {
                    ESP_LOGW(TAG, "========================================");
                    ESP_LOGW(TAG, "=== SNTP Network Diagnostics ===");
                    ESP_LOGW(TAG, "========================================");
                    log_thread_network_info();
                    ESP_LOGW(TAG, "========================================");
                }

                // Force resync with local server
                if (retry_count <= MAX_RETRIES) {
                    ESP_LOGI(TAG, "SNTP: Forcing resync attempt with local server...");
                    esp_sntp_stop();
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    esp_sntp_init();
                } else {
                    // After max retries, wait longer between attempts
                    ESP_LOGW(TAG, "SNTP: Max retries reached, waiting 2 minutes before next attempt");
                    vTaskDelay(pdMS_TO_TICKS(90000));  // Additional wait
                }
            }

            // Retry every 30 seconds when not synced
            vTaskDelay(pdMS_TO_TICKS(30000));
        }
    }
}


