massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
// Attribute update callback
static esp_err_t app_attribute_update_cb(attribute::callback_type_t type,
                                         uint16_t endpoint_id, uint32_t cluster_id,
                                         uint32_t attribute_id, esp_matter_attr_val_t *val,
                                         void *priv_data)
{
    if (type == POST_UPDATE) {
        // Check if it's an OnOff cluster update
        if (cluster_id == OnOff::Id && attribute_id == OnOff::Attributes::OnOff::Id) {
            // Check which output endpoint it is
            for (int i = 0; i < 2; i++) {
                if (endpoint_id == output_endpoint_ids[i]) {
                    // Active-low logic: Matter ON (true) = GPIO LOW (0)
                    gpio_set_level(output_pins[i], val->val.b ? 0 : 1);
                    ESP_LOGI(TAG, "Output %d (GPIO%d) set to %s (GPIO=%d)", i + 1, output_pins[i],
                             val->val.b ? "ON" : "OFF", val->val.b ? 0 : 1);
                    break;
                }
            }

            // SCD40 Control Commands via Matter/OpenHAB
            if (!scd40_available) {
                ESP_LOGW(TAG, "SCD40 not available - ignoring command");
                return ESP_OK;
            }

            // Trigger Forced Calibration (400 ppm fresh air)
            if (endpoint_id == scd40_calibrate_endpoint_id && val->val.b) {
                ESP_LOGI(TAG, "OpenHAB: Trigger SCD40 forced calibration (400 ppm)");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                int16_t correction;
                esp_err_t err = scd40_perform_forced_recalibration(400, &correction);
                if (err == ESP_OK) {
                    ESP_LOGI(TAG, "Calibration completed. Correction: %d ppm", correction);
                } else {
                    ESP_LOGE(TAG, "Calibration FAILED!");
                }

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Auto-reset switch to OFF
                val->val.b = false;
                attribute::update(endpoint_id, cluster_id, attribute_id, val);
            }

            // Enable/Disable Automatic Self-Calibration
            if (endpoint_id == scd40_asc_enable_endpoint_id) {
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 ASC %s", val->val.b ? "ENABLED" : "DISABLED");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_set_automatic_self_calibration_enabled(val->val.b);

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);
            }

            // Switch Low Power Mode
            if (endpoint_id == scd40_low_power_endpoint_id) {
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 %s mode", val->val.b ? "LOW POWER" : "NORMAL");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                if (val->val.b) {
                    scd40_start_low_power_periodic_measurement();  // 30s interval
                } else {
                    scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);  // 5s interval
                }
            }

            // Trigger Persist Settings
            if (endpoint_id == scd40_persist_endpoint_id && val->val.b) {
                ESP_LOGI(TAG, "OpenHAB: Trigger SCD40 persist settings to EEPROM");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_persist_settings();

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Auto-reset switch to OFF
                val->val.b = false;
                attribute::update(endpoint_id, cluster_id, attribute_id, val);
            }

            // Trigger Self Test
            if (endpoint_id == scd40_self_test_endpoint_id && val->val.b) {
                ESP_LOGI(TAG, "OpenHAB: Trigger SCD40 self-test (takes 5.5 seconds)");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                bool test_passed;
                esp_err_t err = scd40_perform_self_test(&test_passed);
                if (err == ESP_OK) {
                    ESP_LOGI(TAG, "Self-test: %s", test_passed ? "PASSED" : "FAILED");
                }

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Auto-reset switch to OFF
                val->val.b = false;
                attribute::update(endpoint_id, cluster_id, attribute_id, val);
            }
        }

        // On/Off cluster (for altitude, temperature offset virtual dimmers)
        // Matter automatically tries to set on/off when level changes - handle it gracefully
        if (cluster_id == OnOff::Id && attribute_id == OnOff::Attributes::OnOff::Id) {
            if (endpoint_id == scd40_altitude_endpoint_id || endpoint_id == scd40_temp_offset_endpoint_id) {
                // These are virtual dimmers - always keep them "on", silently ignore state changes
                return ESP_OK;
            }
        }

        // Level Control cluster (for altitude, temperature offset)
        if (cluster_id == LevelControl::Id && attribute_id == LevelControl::Attributes::CurrentLevel::Id) {
            // IMPORTANT: Ignore attribute updates during boot initialization
            // This prevents Matter SDK from overwriting EEPROM values with defaults
            if (!device_initialization_complete) {
                ESP_LOGD(TAG, "Ignoring Level Control update during boot initialization (endpoint %u, level %u)",
                         endpoint_id, val->val.u8);
                return ESP_OK;
            }

            // SCD40 endpoints require sensor to be available
            if (!scd40_available) {
                if (endpoint_id == scd40_altitude_endpoint_id || endpoint_id == scd40_temp_offset_endpoint_id) {
                    ESP_LOGW(TAG, "SCD40 not available - ignoring command");
                }
                return ESP_OK;
            }

            // Set Altitude (0-5000 meters, mapped to 1-255 level)
            if (endpoint_id == scd40_altitude_endpoint_id) {
                // Map level (1-255) to altitude (0-5000m): level 1=0m, level 255=5000m
                uint16_t altitude = ((val->val.u8 - 1) * 5000) / 254;
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 altitude %u meters", altitude);

