massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_set_sensor_altitude(altitude);

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Save immediately to NVS for persistence across reboots
                nvs_save_altitude(altitude);

                return ESP_OK;
            }

            // Set Temperature Offset (0-10°C, mapped to 1-255 level)
            if (endpoint_id == scd40_temp_offset_endpoint_id) {
                // Map level (1-255) to offset (0-10°C): level 1=0°C, level 255=10°C
                float offset = ((val->val.u8 - 1) * 10.0f) / 254.0f;
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 temperature offset %.2f°C", offset);

                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_set_temperature_offset(offset);

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Save immediately to NVS for persistence across reboots
                nvs_save_temp_offset(offset);

                return ESP_OK;
            }
        }
    }
    return ESP_OK;
}

// Identification callback
static esp_err_t app_identification_cb(identification::callback_type_t type,
                                       uint16_t endpoint_id, uint8_t effect_id,
                                       uint8_t effect_variant, void *priv_data)
{
    ESP_LOGI(TAG, "Identification callback: type=%u, endpoint=%u", type, endpoint_id);
    return ESP_OK;
}

// GPIO input monitoring task
// Monitors 4 independent inputs and reports state changes via Matter
static void gpio_input_task(void *arg)
{
    bool last_states[4] = {true, true, true, true};  // Assume pull-up, initial HIGH
    bool current_state;

    while (1) {
        // Monitor all 4 inputs
        for (int i = 0; i < 4; i++) {
            current_state = gpio_get_level(input_pins[i]);

            // Detect state change
            if (current_state != last_states[i]) {
                // Matter BooleanState: StateValue=true means "contact detected" (closed)
                // GPIO with pull-up: LOW=contact closed, HIGH=contact open
                // Invert: LOW(false)->true(closed), HIGH(true)->false(open)
                bool contact_detected = !current_state;

                ESP_LOGI(TAG, "Input %d (GPIO%d) changed to %s", i + 1, input_pins[i],
                         contact_detected ? "CLOSED" : "OPEN");

                // Use BooleanState cluster to report contact sensor state
                // StateValue: true=contact detected (closed), false=no contact (open)
                if (input_endpoint_ids[i] != 0) {
                    // Get the BooleanStateCluster instance for this endpoint
                    chip::DeviceLayer::PlatformMgr().LockChipStack();
                    auto* booleanStateCluster = ESPMatterBooleanStateGetCluster(input_endpoint_ids[i]);
                    if (booleanStateCluster != nullptr) {
                        // SetStateValue updates the attribute, notifies subscribers, and generates StateChange event
                        auto eventNumber = booleanStateCluster->SetStateValue(contact_detected);
                        if (eventNumber.has_value()) {
                            ESP_LOGI(TAG, "Input %d StateChange event logged (eventNumber=%llu)", i + 1, eventNumber.value());
                        } else {
                            ESP_LOGD(TAG, "Input %d state unchanged or no event generated", i + 1);
                        }
                    } else {
                        ESP_LOGW(TAG, "Failed to get BooleanStateCluster for input %d endpoint %u", i + 1, input_endpoint_ids[i]);
                    }
                    chip::DeviceLayer::PlatformMgr().UnlockChipStack();
                } else {
                    ESP_LOGW(TAG, "Input %d endpoint ID is 0 - not initialized", i + 1);
                }

                last_states[i] = current_state;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(50));  // 50ms polling interval with debounce
    }
}

// SCD40 sensor reading task
// Reads CO2, temperature, and humidity every 5 seconds and updates Matter attributes
static void scd40_sensor_task(void *arg)
{
    ESP_LOGI(TAG, "SCD40 sensor task started");

    // Check if sensor is available
    if (!scd40_available) {
        ESP_LOGW(TAG, "SCD40 sensor not available - task will not read sensor");
        ESP_LOGI(TAG, "SCD40 sensor task terminating (sensor not connected)");
        vTaskDelete(NULL);  // Terminate task if sensor not available
        return;
    }

    // Wait for first measurement to be ready (SCD40 needs 5 seconds after start)
    vTaskDelay(pdMS_TO_TICKS(5000));

    ESP_LOGI(TAG, "SCD40 sensor task: endpoint IDs - CO2=%u, Temp=%u, Hum=%u",
             co2_endpoint_id, temperature_endpoint_id, humidity_endpoint_id);

    while (1) {
        uint16_t co2;
        float temperature, humidity;

        // Read measurement from SCD40
        esp_err_t err = scd40_read_measurement(&co2, &temperature, &humidity);

        if (err == ESP_OK) {
            // Reset error counter on successful read
            scd40_consecutive_errors = 0;

            // Update global variables (locked: read concurrently by display_rotation_task)
            if (scd40_data_mutex && xSemaphoreTake(scd40_data_mutex, portMAX_DELAY) == pdTRUE) {
                scd40_co2 = co2;
                scd40_temperature = temperature;
                scd40_humidity = humidity;
                xSemaphoreGive(scd40_data_mutex);
            }

            ESP_LOGI(TAG, "SCD40: CO2=%u ppm, Temp=%.2f°C, Humidity=%.2f%%RH",
                     co2, temperature, humidity);

            // Update Matter attributes
            esp_matter_attr_val_t val;

            // Calculate current values in Matter format
            int16_t current_temp = (int16_t)(temperature * 100);
            uint16_t current_humidity = (uint16_t)(humidity * 100);
            uint8_t air_quality_val = calculate_air_quality_from_co2(co2);

            // Check if values have changed significantly to reduce network traffic
            bool co2_changed = (abs((int)co2 - (int)last_reported_co2) >= CO2_REPORT_THRESHOLD);
            bool temp_changed = (abs(current_temp - last_reported_temp) >= TEMP_REPORT_THRESHOLD);
            bool humidity_changed = (abs((int)current_humidity - (int)last_reported_humidity) >= HUMIDITY_REPORT_THRESHOLD);
            bool air_quality_changed = (air_quality_val != last_reported_air_quality);

