massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
            // Update Air Quality enum only if changed
            if (gAirQualityInstance && air_quality_changed) {
                chip::app::Clusters::AirQuality::AirQualityEnum air_quality_enum;

                switch (air_quality_val) {
                    case 0x01: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kGood; break;
                    case 0x02: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kFair; break;
                    case 0x03: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kModerate; break;
                    case 0x04: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kPoor; break;
                    case 0x05: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kVeryPoor; break;
                    case 0x06: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kExtremelyPoor; break;
                    default: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kUnknown; break;
                }

                chip::DeviceLayer::PlatformMgr().LockChipStack();
                auto status = gAirQualityInstance->UpdateAirQuality(air_quality_enum);
                chip::DeviceLayer::PlatformMgr().UnlockChipStack();

                if (status == chip::Protocols::InteractionModel::Status::Success) {
                    last_reported_air_quality = air_quality_val;
                    ESP_LOGI(TAG, "Air Quality updated to: %u (CO2: %u ppm)", air_quality_val, co2);
                }
            }

            // Update CO2 only if changed significantly
            if (co2_endpoint_id != 0 && co2_changed) {
                val.type = ESP_MATTER_VAL_TYPE_NULLABLE_FLOAT;
                val.val.f = (float)co2;
                esp_err_t err_co2 = attribute::update(co2_endpoint_id,
                                 CarbonDioxideConcentrationMeasurement::Id,
                                 CarbonDioxideConcentrationMeasurement::Attributes::MeasuredValue::Id,
                                 &val);
                if (err_co2 == ESP_OK) {
                    last_reported_co2 = co2;
                }
            }

            // Update Temperature only if changed significantly
            if (temperature_endpoint_id != 0 && temp_changed) {
                val.type = ESP_MATTER_VAL_TYPE_NULLABLE_INT16;
                val.val.i16 = current_temp;
                esp_err_t err_temp = attribute::update(temperature_endpoint_id,
                                 TemperatureMeasurement::Id,
                                 TemperatureMeasurement::Attributes::MeasuredValue::Id,
                                 &val);
                if (err_temp == ESP_OK) {
                    last_reported_temp = current_temp;
                }
            }

            // Update Humidity only if changed significantly
            if (humidity_endpoint_id != 0 && humidity_changed) {
                val.type = ESP_MATTER_VAL_TYPE_NULLABLE_UINT16;
                val.val.u16 = current_humidity;
                esp_err_t err_hum = attribute::update(humidity_endpoint_id,
                                 RelativeHumidityMeasurement::Id,
                                 RelativeHumidityMeasurement::Attributes::MeasuredValue::Id,
                                 &val);
                if (err_hum == ESP_OK) {
                    last_reported_humidity = current_humidity;
                }
            }

            // Note: the OLED is no longer updated here. scd40_co2/scd40_temperature/
            // scd40_humidity (set above) are read independently by display_rotation_task,
            // which redraws the screen on its own faster cadence to animate the
            // rotating big-value display (see DISPLAY_ROTATION_*_MS below).
        } else {
            scd40_consecutive_errors++;
            ESP_LOGW(TAG, "Failed to read SCD40 measurement (error %d/%d)",
                     scd40_consecutive_errors, SCD40_MAX_ERRORS_BEFORE_REINIT);

            // Attempt I2C bus reinitialization after too many errors
            if (scd40_consecutive_errors >= SCD40_MAX_ERRORS_BEFORE_REINIT) {
                ESP_LOGW(TAG, "Too many consecutive errors - attempting I2C bus recovery...");

                esp_err_t reinit_err = i2c_bus_reinit();
                if (reinit_err == ESP_OK) {
                    scd40_consecutive_errors = 0;
                    // Wait for first measurement after reinit
                    vTaskDelay(pdMS_TO_TICKS(5000));
                } else {
                    ESP_LOGE(TAG, "I2C recovery failed - will retry on next cycle");
                    scd40_consecutive_errors = 0;  // Reset to avoid rapid reinit attempts
                }
            }
        }

        // SCD40 provides new data every 5 seconds
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

// ==============================================================================
// Display Rotation Task
// ==============================================================================
// Redraws the OLED on its own cadence (CONFIG_DISPLAY_UPDATE_INTERVAL_MS),
// independent of the 5s SCD40 read cycle, so it can animate the rotating
// big-value display: Temperature, Humidity, CO2, each shown for a different
// duration, reading the latest values from scd40_temperature/humidity/co2
// (updated by scd40_sensor_task).
#define DISPLAY_ROTATION_TEMPERATURE_MS  5000  // Temperature shown for 5s
#define DISPLAY_ROTATION_HUMIDITY_MS     3000  // Humidity shown for 3s
#define DISPLAY_ROTATION_CO2_MS          2000  // CO2 (ppm) shown for 2s

static void display_rotation_task(void *arg)
{
    ESP_LOGI(TAG, "Display rotation task started (Temp %dms / Hum %dms / CO2 %dms)",
             DISPLAY_ROTATION_TEMPERATURE_MS, DISPLAY_ROTATION_HUMIDITY_MS, DISPLAY_ROTATION_CO2_MS);

    oled_rotating_value_t current_value = OLED_ROTATING_TEMPERATURE;
    uint32_t elapsed_in_value_ms = 0;
    const uint32_t tick_ms = CONFIG_DISPLAY_UPDATE_INTERVAL_MS;

    while (1) {
        if (oled_available) {
            // Determine how long the current value has been shown and advance
            // to the next one once its duration elapses (Temp -> Hum -> CO2 -> Temp).
            uint32_t duration_ms;
            switch (current_value) {
                case OLED_ROTATING_TEMPERATURE: duration_ms = DISPLAY_ROTATION_TEMPERATURE_MS; break;
                case OLED_ROTATING_HUMIDITY:    duration_ms = DISPLAY_ROTATION_HUMIDITY_MS;    break;
                case OLED_ROTATING_CO2:
                default:                         duration_ms = DISPLAY_ROTATION_CO2_MS;         break;
            }

            elapsed_in_value_ms += tick_ms;
            if (elapsed_in_value_ms >= duration_ms) {
                elapsed_in_value_ms = 0;
                switch (current_value) {
                    case OLED_ROTATING_TEMPERATURE: current_value = OLED_ROTATING_HUMIDITY;    break;
                    case OLED_ROTATING_HUMIDITY:    current_value = OLED_ROTATING_CO2;         break;
                    case OLED_ROTATING_CO2:
                    default:                         current_value = OLED_ROTATING_TEMPERATURE; break;
                }
            }

