massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
            // Get Thread connection status
            bool thread_connected = false;
            uint8_t node_count = 0;
#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
            otInstance *ot_instance = esp_openthread_get_instance();
            if (ot_instance) {
                otDeviceRole role = otThreadGetDeviceRole(ot_instance);
                thread_connected = (role >= OT_DEVICE_ROLE_CHILD);
                if (thread_connected) {
                    node_count = 1;  // Start with self

                    // Count neighbor nodes from neighbor table
                    otNeighborInfoIterator iterator = OT_NEIGHBOR_INFO_ITERATOR_INIT;
                    otNeighborInfo neighborInfo;
                    while (otThreadGetNextNeighborInfo(ot_instance, &iterator, &neighborInfo) == OT_ERROR_NONE) {
                        node_count++;
                    }
                }
            }
#endif
            // Get current I/O states
            uint8_t input_states = 0;
            uint8_t output_states = 0;
            for (int i = 0; i < 4; i++) {
                if (gpio_get_level(input_pins[i]) == 0) {  // Active low (contact closed)
                    input_states |= (1 << i);
                }
            }
            for (int i = 0; i < 2; i++) {
                // Active-low logic: GPIO LOW (0) = output ON
                if (gpio_get_level(output_pins[i]) == 0) {
                    output_states |= (1 << i);
                }
            }

            // Get current time
            time_t now;
            struct tm timeinfo;
            time(&now);
            localtime_r(&now, &timeinfo);

            // Snapshot the shared sensor readings under lock (written concurrently
            // by scd40_sensor_task) so the values used below are self-consistent.
            uint16_t co2_snapshot;
            float temperature_snapshot, humidity_snapshot;
            if (scd40_data_mutex && xSemaphoreTake(scd40_data_mutex, portMAX_DELAY) == pdTRUE) {
                co2_snapshot = scd40_co2;
                temperature_snapshot = scd40_temperature;
                humidity_snapshot = scd40_humidity;
                xSemaphoreGive(scd40_data_mutex);
            } else {
                co2_snapshot = scd40_co2;
                temperature_snapshot = scd40_temperature;
                humidity_snapshot = scd40_humidity;
            }

            // Calculate air quality from the latest CO2 reading
            uint8_t oled_air_quality = calculate_air_quality_from_co2(co2_snapshot);

            oled_update_sensor_display(co2_snapshot, temperature_snapshot, humidity_snapshot,
                                       thread_connected, node_count,
                                       input_states, output_states,
                                       timeinfo.tm_mday, timeinfo.tm_mon + 1, timeinfo.tm_year + 1900,
                                       timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec,
                                       oled_air_quality, current_value);
        }

        vTaskDelay(pdMS_TO_TICKS(tick_ms));
    }
}

// ==============================================================================
// SCD40 Configuration Sync Task
// ==============================================================================
// Syncs altitude and temperature offset values from EEPROM to OpenHAB after boot
// Delayed to ensure Matter connection is fully established
static void scd40_config_sync_task(void *arg)
{
    // Wait 10 seconds for Matter/Thread connection to stabilize
    ESP_LOGI(TAG, "SCD40 config sync task started - waiting 10s for Matter connection...");
    vTaskDelay(pdMS_TO_TICKS(10000));

    if (!scd40_available) {
        ESP_LOGI(TAG, "SCD40 not available - skipping config sync");
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "Syncing SCD40 configuration to OpenHAB...");

    // Update altitude attribute (Level Control cluster)
    if (scd40_altitude_endpoint_id != 0) {
        uint8_t altitude_level = (uint8_t)(((loaded_altitude_meters * 254) + 2500) / 5000) + 1;
        esp_matter_attr_val_t altitude_val = esp_matter_invalid(NULL);
        altitude_val.type = ESP_MATTER_VAL_TYPE_NULLABLE_UINT8;
        altitude_val.val.u8 = altitude_level;

        esp_err_t err = attribute::update(scd40_altitude_endpoint_id,
                        LevelControl::Id,
                        LevelControl::Attributes::CurrentLevel::Id,
                        &altitude_val);

        if (err == ESP_OK) {
            ESP_LOGI(TAG, "→ OpenHAB: Synced altitude %um (level %u)", loaded_altitude_meters, altitude_level);
        } else {
            ESP_LOGW(TAG, "Failed to sync altitude: %s", esp_err_to_name(err));
        }
    }

    // Update temperature offset attribute (Level Control cluster)
    if (scd40_temp_offset_endpoint_id != 0) {
        uint8_t temp_offset_level = (uint8_t)(((loaded_temp_offset_celsius * 254.0f) + 5.0f) / 10.0f) + 1;
        esp_matter_attr_val_t temp_offset_val = esp_matter_invalid(NULL);
        temp_offset_val.type = ESP_MATTER_VAL_TYPE_NULLABLE_UINT8;
        temp_offset_val.val.u8 = temp_offset_level;

        esp_err_t err = attribute::update(scd40_temp_offset_endpoint_id,
                        LevelControl::Id,
                        LevelControl::Attributes::CurrentLevel::Id,
                        &temp_offset_val);

        if (err == ESP_OK) {
            ESP_LOGI(TAG, "→ OpenHAB: Synced temp offset %.2f°C (level %u)", loaded_temp_offset_celsius, temp_offset_level);
        } else {
            ESP_LOGW(TAG, "Failed to sync temp offset: %s", esp_err_to_name(err));
        }
    }

    ESP_LOGI(TAG, "✓ SCD40 configuration synced to OpenHAB");

    // Task completes - delete itself
    vTaskDelete(NULL);
}

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
// Thread role monitoring task - Controls status LED
// LED patterns indicate Thread device role in mesh network
static void thread_status_led_task(void *arg)
{
    otDeviceRole last_role = OT_DEVICE_ROLE_DISABLED;

    ESP_LOGI(TAG, "Thread status LED task started on GPIO%d", GPIO_STATUS_LED);

    while (1) {
        // Get OpenThread instance
        otInstance *instance = esp_openthread_get_instance();
        if (instance) {
            otDeviceRole role = otThreadGetDeviceRole(instance);

            // Log role changes
            if (role != last_role) {
                const char *role_str = "UNKNOWN";
                switch (role) {
                    case OT_DEVICE_ROLE_DISABLED:  role_str = "DISABLED"; break;
                    case OT_DEVICE_ROLE_DETACHED:  role_str = "DETACHED"; break;
                    case OT_DEVICE_ROLE_CHILD:     role_str = "END DEVICE (Child)"; break;
                    case OT_DEVICE_ROLE_ROUTER:    role_str = "ROUTER"; break;
                    case OT_DEVICE_ROLE_LEADER:    role_str = "LEADER (Router)"; break;
                }
                ESP_LOGI(TAG, "Thread role changed: %s", role_str);
                last_role = role;
            }

            // Determine LED pattern based on role
            switch (role) {
                case OT_DEVICE_ROLE_DISABLED:
                case OT_DEVICE_ROLE_DETACHED:
                    // Not connected - LED OFF
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    break;

                case OT_DEVICE_ROLE_CHILD:
                    // End Device (no routing) - LED ON (solid)
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    break;

                case OT_DEVICE_ROLE_ROUTER:
                    // Router - Single blink (250ms ON, 750ms OFF = 1 second cycle)
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(250));
                    break;

                case OT_DEVICE_ROLE_LEADER:
                    // Leader - Double blink (200ms ON, 200ms OFF, 200ms ON, 600ms OFF = 1200ms cycle)
                    // First blink
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(250));
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(200));
                    // Second blink
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(250));
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    break;

                default:
                    // Unknown - Fast blink
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(100));
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(100));
                    break;
            }
        } else {
            // OpenThread not available - LED OFF
            gpio_set_level(GPIO_STATUS_LED, 0);
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
}
#endif // CHIP_DEVICE_CONFIG_ENABLE_THREAD

extern "C" void app_main()
{
    // EARLY DEBUG: Test USB Serial output immediately
    printf("\n\n");
    printf("==============================================\n");
    printf("ESP32C6 XIAO - USB SERIAL TEST\n");
    printf("==============================================\n");
    printf("If you see this, USB Serial is working!\n\n");

    esp_err_t err = ESP_OK;

    // Initialize NVS
    err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    // Set custom Vendor Name and Product Name in NVS BEFORE Matter starts
    const char *vendor_name = "VicinoDiCasaDigitale";
    const char *product_name = "Matter Thread 4in/2out+SCD40";

    chip::DeviceLayer::Internal::ESP32Config::WriteConfigValueStr(
        chip::DeviceLayer::Internal::ESP32Config::kConfigKey_VendorName, vendor_name);
    chip::DeviceLayer::Internal::ESP32Config::WriteConfigValueStr(
        chip::DeviceLayer::Internal::ESP32Config::kConfigKey_ProductName, product_name);

    ESP_LOGI(TAG, "Device info configured in NVS: Vendor=%s, Product=%s", vendor_name, product_name);

    // Configure antenna (XIAO ESP32C6 specific - must be done BEFORE radio operations)
    configure_antenna();

    // Initialize I2C for SCD40 sensor (optional - allows boot without sensor)
    err = i2c_master_init();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "I2C initialization failed - SCD40 sensor disabled");
        ESP_LOGW(TAG, "Device will continue without CO2/Temperature/Humidity sensor");
        scd40_available = false;
    } else {
        // Wait for SCD40 power-on (datasheet requires min 1000ms after power-up)
        ESP_LOGI(TAG, "Waiting for SCD40 power-on (3000ms)...");
        vTaskDelay(pdMS_TO_TICKS(3000));

        // Initialize SCD40 sensor only if I2C works
        err = scd40_init();
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "SCD40 sensor initialization failed - sensor disabled");
            ESP_LOGW(TAG, "Device will continue without CO2/Temperature/Humidity sensor");
            scd40_available = false;
        } else {
            ESP_LOGI(TAG, "SCD40 sensor initialized successfully");
            scd40_available = true;

            // ==============================================================================
            // EARLY EEPROM READ: Load SCD40 configuration before Matter endpoints are created
            // This prevents I2C handle corruption that can occur after heavy memory allocation
            // ==============================================================================
            ESP_LOGI(TAG, "Reading configuration from SCD40 EEPROM (early read)...");

            // Stop periodic measurement to allow EEPROM read
            scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
            vTaskDelay(pdMS_TO_TICKS(500));

