massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
            // Try to read altitude from SCD40 EEPROM
            uint16_t eeprom_altitude = 0;
            if (scd40_get_sensor_altitude(&eeprom_altitude) == ESP_OK) {
                loaded_altitude_meters = eeprom_altitude;
                ESP_LOGI(TAG, "✓ Altitude from SCD40 EEPROM: %um", loaded_altitude_meters);
                nvs_save_altitude(loaded_altitude_meters);
            } else {
                // Fallback to NVS
                uint16_t nvs_altitude = 0;
                if (nvs_load_altitude(&nvs_altitude) == ESP_OK) {
                    loaded_altitude_meters = nvs_altitude;
                    ESP_LOGI(TAG, "Altitude from NVS: %um", loaded_altitude_meters);
                } else {
                    loaded_altitude_meters = 0;
                    ESP_LOGI(TAG, "No altitude found, using default: 0m");
                }
            }

            // Try to read temperature offset from SCD40 EEPROM
            float eeprom_temp_offset = 0.0f;
            if (scd40_get_temperature_offset(&eeprom_temp_offset) == ESP_OK) {
                loaded_temp_offset_celsius = eeprom_temp_offset;
                ESP_LOGI(TAG, "✓ Temp offset from SCD40 EEPROM: %.2f°C", loaded_temp_offset_celsius);
                nvs_save_temp_offset(loaded_temp_offset_celsius);
            } else {
                // Fallback to NVS
                float nvs_temp_offset = 4.0f;
                if (nvs_load_temp_offset(&nvs_temp_offset) == ESP_OK) {
                    loaded_temp_offset_celsius = nvs_temp_offset;
                    ESP_LOGI(TAG, "Temp offset from NVS: %.2f°C", loaded_temp_offset_celsius);
                } else {
                    loaded_temp_offset_celsius = 4.0f;
                    ESP_LOGI(TAG, "No temp offset found, using default: 4.0°C");
                }
            }

            // Apply configuration to SCD40 immediately
            ESP_LOGI(TAG, "Applying configuration to SCD40...");
            scd40_set_temperature_offset(loaded_temp_offset_celsius);
            scd40_set_sensor_altitude(loaded_altitude_meters);

            // Restart periodic measurement
            scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);
            ESP_LOGI(TAG, "SCD40 configuration loaded and applied successfully");
        }

        // Initialize OLED display with shared I2C bus
        oled_config_t oled_cfg = OLED_CONFIG_DEFAULT();
        oled_cfg.i2c_bus = i2c_bus_handle;  // Use the same bus as SCD40
        err = oled_init(&oled_cfg);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "OLED initialization failed - continuing without display");
            oled_available = false;
        } else {
            ESP_LOGI(TAG, "OLED display initialized successfully");
            oled_available = true;
            // Show splash screen
            oled_show_splash();
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }

    // Configure GPIOs
    gpio_config_t io_conf = {};

    // Configure 2 outputs (GPIO19, GPIO20)
    // Use INPUT_OUTPUT mode to allow reading back the output state for display
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT_OUTPUT;
    io_conf.pin_bit_mask = (1ULL << GPIO_OUTPUT_0) | (1ULL << GPIO_OUTPUT_1);
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);

    // Initialize all outputs to OFF (HIGH for active-low logic)
    for (int i = 0; i < 2; i++) {
        gpio_set_level(output_pins[i], 1);
    }

    // Configure 4 inputs (D0-D3)
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = (1ULL << GPIO_INPUT_0) | (1ULL << GPIO_INPUT_1) |
                           (1ULL << GPIO_INPUT_2) | (1ULL << GPIO_INPUT_3);
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    gpio_config(&io_conf);

    // Configure Status LED (USER LED on GPIO15)
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = (1ULL << GPIO_STATUS_LED);
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);
    gpio_set_level(GPIO_STATUS_LED, 0);  // Initially OFF

    ESP_LOGI(TAG, "GPIOs configured:");
    ESP_LOGI(TAG, "  Inputs: GPIO%d, %d, %d, %d",
             GPIO_INPUT_0, GPIO_INPUT_1, GPIO_INPUT_2, GPIO_INPUT_3);
    ESP_LOGI(TAG, "  Outputs: GPIO%d, %d",
             GPIO_OUTPUT_0, GPIO_OUTPUT_1);
    ESP_LOGI(TAG, "  I2C: SDA=GPIO%d, SCL=GPIO%d", I2C_MASTER_SDA_IO, I2C_MASTER_SCL_IO);
    ESP_LOGI(TAG, "  Status LED: GPIO%d (Thread role indicator)", GPIO_STATUS_LED);

    // Create Matter node
    node::config_t node_config;
    node_t *node = node::create(&node_config, app_attribute_update_cb, app_identification_cb);
    if (!node) {
        ESP_LOGE(TAG, "Failed to create Matter node");
        return;
    }

    ESP_LOGI(TAG, "Creating Matter endpoints...");

    // Create 4 Input Endpoints (Contact Sensors)
    for (int i = 0; i < 4; i++) {
        contact_sensor::config_t sensor_config;
        // With pull-up: HIGH=open, we report as false (contact/closed)
        sensor_config.boolean_state.state_value = false;  // Initial state: closed (HIGH with pull-up inverted)

        endpoint_t *input_endpoint = contact_sensor::create(node, &sensor_config, ENDPOINT_FLAG_NONE, NULL);
        if (!input_endpoint) {
            ESP_LOGE(TAG, "Failed to create input endpoint %d", i + 1);
            return;
        }

        input_endpoint_ids[i] = endpoint::get_id(input_endpoint);
        ESP_LOGI(TAG, "Input %d (GPIO%d) endpoint created with id %u",
                 i + 1, input_pins[i], input_endpoint_ids[i]);
    }

    // Create 2 Output Endpoints (On/Off Lights)
    for (int i = 0; i < 2; i++) {
        on_off_light::config_t light_config;
        light_config.on_off.on_off = false;  // Initial state: OFF
        light_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *output_endpoint = on_off_light::create(node, &light_config, ENDPOINT_FLAG_NONE, NULL);
        if (!output_endpoint) {
            ESP_LOGE(TAG, "Failed to create output endpoint %d", i + 1);
            return;
        }

        output_endpoint_ids[i] = endpoint::get_id(output_endpoint);
        ESP_LOGI(TAG, "Output %d (GPIO%d) endpoint created with id %u",
                 i + 1, output_pins[i], output_endpoint_ids[i]);
    }

    // Create SCD40 sensor endpoints only if sensor is available
    if (scd40_available) {
        ESP_LOGI(TAG, "Creating SCD40 sensor endpoints (Air Quality with CO2, Temperature, Humidity)...");

        // Create Air Quality Sensor endpoint (device type 0x002C)
        // This endpoint will contain BOTH Air Quality enum AND CO2 PPM measurement
        air_quality_sensor::config_t air_quality_config;
        endpoint_t *air_quality_endpoint = air_quality_sensor::create(node, &air_quality_config, ENDPOINT_FLAG_NONE, NULL);
        if (!air_quality_endpoint) {
            ESP_LOGE(TAG, "Failed to create Air Quality Sensor endpoint");
            return;
        }

