massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
        air_quality_endpoint_id = endpoint::get_id(air_quality_endpoint);

        ESP_LOGI(TAG, "Air Quality Sensor endpoint created with id %u", air_quality_endpoint_id);

        // Create Air Quality Instance for programmatic control
        gAirQualityInstance = new chip::app::Clusters::AirQuality::Instance(
            air_quality_endpoint_id,
            chip::BitMask<chip::app::Clusters::AirQuality::Feature>(
                chip::app::Clusters::AirQuality::Feature::kFair,
                chip::app::Clusters::AirQuality::Feature::kModerate,
                chip::app::Clusters::AirQuality::Feature::kVeryPoor,
                chip::app::Clusters::AirQuality::Feature::kExtremelyPoor
            )
        );

        if (gAirQualityInstance) {
            CHIP_ERROR err = gAirQualityInstance->Init();
            if (err != CHIP_NO_ERROR) {
                ESP_LOGE(TAG, "Failed to initialize Air Quality Instance");
                delete gAirQualityInstance;
                gAirQualityInstance = nullptr;
            }
            // Note: Air Quality will be updated by the sensor task once readings start
        }

        // Create SEPARATE CO2 endpoint using Air Quality Sensor as base
        // Uses Carbon Dioxide Concentration Measurement cluster (0x040D) - Matter standard for CO2 sensors
        // NOTE: OpenHAB 5.1 doesn't support this cluster yet (will show NULL)
        //       OpenHAB 5.2+ will support it (PR #19897 merged Dec 27, 2025)
        //       Air Quality enum (endpoint 7) works on all versions as fallback
        air_quality_sensor::config_t co2_base_config;
        endpoint_t *co2_endpoint = air_quality_sensor::create(node, &co2_base_config, ENDPOINT_FLAG_NONE, NULL);
        if (!co2_endpoint) {
            ESP_LOGE(TAG, "Failed to create CO2 base endpoint");
            return;
        }

        // Add Carbon Dioxide Concentration Measurement cluster (0x040D)
        cluster::concentration_measurement::config_t co2_config;
        co2_config.measurement_medium = 0; // Air
        co2_config.feature_flags = cluster::concentration_measurement::feature::numeric_measurement::get_id();
        co2_config.features.numeric_measurement.measured_value = 400.0f;
        co2_config.features.numeric_measurement.min_measured_value = 400.0f;
        co2_config.features.numeric_measurement.max_measured_value = 5000.0f;
        co2_config.features.numeric_measurement.measurement_unit = 0; // PPM

        cluster_t *co2_cluster = cluster::carbon_dioxide_concentration_measurement::create(
            co2_endpoint, &co2_config, CLUSTER_FLAG_SERVER);
        if (!co2_cluster) {
            ESP_LOGE(TAG, "Failed to create CO2 concentration cluster");
            return;
        }

        co2_endpoint_id = endpoint::get_id(co2_endpoint);
        ESP_LOGI(TAG, "CO2 endpoint created with id %u (cluster 0x040D - requires OpenHAB 5.2+)", co2_endpoint_id);

        // Create Temperature Sensor Endpoint
        temperature_sensor::config_t temp_config;
        temp_config.temperature_measurement.measured_value = 2000; // 20.00°C initial
        temp_config.temperature_measurement.min_measured_value = -4000; // -40.00°C
        temp_config.temperature_measurement.max_measured_value = 12500; // 125.00°C

        endpoint_t *temp_endpoint = temperature_sensor::create(node, &temp_config, ENDPOINT_FLAG_NONE, NULL);
        if (!temp_endpoint) {
            ESP_LOGE(TAG, "Failed to create temperature sensor endpoint");
            return;
        }

        temperature_endpoint_id = endpoint::get_id(temp_endpoint);
        ESP_LOGI(TAG, "Temperature sensor endpoint created with id %u", temperature_endpoint_id);

        // Create Humidity Sensor Endpoint
        humidity_sensor::config_t hum_config;
        hum_config.relative_humidity_measurement.measured_value = 5000; // 50.00%RH initial
        hum_config.relative_humidity_measurement.min_measured_value = (uint16_t)0; // 0.00%RH
        hum_config.relative_humidity_measurement.max_measured_value = (uint16_t)10000; // 100.00%RH

        endpoint_t *hum_endpoint = humidity_sensor::create(node, &hum_config, ENDPOINT_FLAG_NONE, NULL);
        if (!hum_endpoint) {
            ESP_LOGE(TAG, "Failed to create humidity sensor endpoint");
            return;
        }

        humidity_endpoint_id = endpoint::get_id(hum_endpoint);
        ESP_LOGI(TAG, "Humidity sensor endpoint created with id %u", humidity_endpoint_id);

        // ==================================================================
        // Create SCD40 Control Endpoints (Virtual switches for OpenHAB)
        // ==================================================================
        ESP_LOGI(TAG, "Creating SCD40 control endpoints for OpenHAB...");

        // 1. Trigger Forced Calibration (On/Off Light - momentary switch)
        on_off_light::config_t calibrate_config;
        calibrate_config.on_off.on_off = false;
        calibrate_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *calibrate_endpoint = on_off_light::create(node, &calibrate_config, ENDPOINT_FLAG_NONE, NULL);
        if (calibrate_endpoint) {
            scd40_calibrate_endpoint_id = endpoint::get_id(calibrate_endpoint);
            ESP_LOGI(TAG, "SCD40 Calibrate switch created with id %u", scd40_calibrate_endpoint_id);
        }

        // 2. ASC Enable/Disable (On/Off Light - persistent switch)
        on_off_light::config_t asc_config;
        asc_config.on_off.on_off = true;  // ASC enabled by default
        asc_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *asc_endpoint = on_off_light::create(node, &asc_config, ENDPOINT_FLAG_NONE, NULL);
        if (asc_endpoint) {
            scd40_asc_enable_endpoint_id = endpoint::get_id(asc_endpoint);
            ESP_LOGI(TAG, "SCD40 ASC Enable switch created with id %u", scd40_asc_enable_endpoint_id);
        }

        // 3. Low Power Mode (On/Off Light - persistent switch)
        on_off_light::config_t low_power_config;
        low_power_config.on_off.on_off = false;  // Normal mode by default
        low_power_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *low_power_endpoint = on_off_light::create(node, &low_power_config, ENDPOINT_FLAG_NONE, NULL);
        if (low_power_endpoint) {
            scd40_low_power_endpoint_id = endpoint::get_id(low_power_endpoint);
            ESP_LOGI(TAG, "SCD40 Low Power switch created with id %u", scd40_low_power_endpoint_id);
        }

        // 4. Trigger Persist Settings (On/Off Light - momentary switch)
        on_off_light::config_t persist_config;
        persist_config.on_off.on_off = false;
        persist_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *persist_endpoint = on_off_light::create(node, &persist_config, ENDPOINT_FLAG_NONE, NULL);
        if (persist_endpoint) {
            scd40_persist_endpoint_id = endpoint::get_id(persist_endpoint);
            ESP_LOGI(TAG, "SCD40 Persist Settings switch created with id %u", scd40_persist_endpoint_id);
        }

        // 5. Trigger Self Test (On/Off Light - momentary switch)
        on_off_light::config_t self_test_config;
        self_test_config.on_off.on_off = false;
        self_test_config.on_off_lighting.start_up_on_off = nullptr;

