massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
        endpoint_t *self_test_endpoint = on_off_light::create(node, &self_test_config, ENDPOINT_FLAG_NONE, NULL);
        if (self_test_endpoint) {
            scd40_self_test_endpoint_id = endpoint::get_id(self_test_endpoint);
            ESP_LOGI(TAG, "SCD40 Self Test switch created with id %u", scd40_self_test_endpoint_id);
        }

        // ==============================================================================
        // Create Altitude and Temperature Offset control endpoints
        // NOTE: SCD40 configuration was already loaded and applied early in init,
        // using globals loaded_altitude_meters and loaded_temp_offset_celsius
        // ==============================================================================

        // 6. Set Altitude (Dimmable Light with Level Control - 0-5000 meters mapped to 1-255)
        // Formula: level = (altitude * 254 / 5000) + 1, with rounding
        uint8_t altitude_level = (uint8_t)(((loaded_altitude_meters * 254) + 2500) / 5000) + 1;
        dimmable_light::config_t altitude_config;
        altitude_config.on_off.on_off = true;
        altitude_config.on_off_lighting.start_up_on_off = nullptr;
        altitude_config.level_control.current_level = altitude_level;

        endpoint_t *altitude_endpoint = dimmable_light::create(node, &altitude_config, ENDPOINT_FLAG_NONE, NULL);
        if (altitude_endpoint) {
            scd40_altitude_endpoint_id = endpoint::get_id(altitude_endpoint);
            ESP_LOGI(TAG, "SCD40 Altitude control created with id %u (initial: %um, level %u)",
                     scd40_altitude_endpoint_id, loaded_altitude_meters, altitude_level);
        }

        // 7. Set Temperature Offset (Dimmable Light with Level Control - 0-10°C mapped to 1-255)
        // Formula: level = (offset * 254 / 10) + 1, with rounding
        uint8_t temp_offset_level = (uint8_t)(((loaded_temp_offset_celsius * 254.0f) + 5.0f) / 10.0f) + 1;
        dimmable_light::config_t temp_offset_config;
        temp_offset_config.on_off.on_off = true;
        temp_offset_config.on_off_lighting.start_up_on_off = nullptr;
        temp_offset_config.level_control.current_level = temp_offset_level;

        endpoint_t *temp_offset_endpoint = dimmable_light::create(node, &temp_offset_config, ENDPOINT_FLAG_NONE, NULL);
        if (temp_offset_endpoint) {
            scd40_temp_offset_endpoint_id = endpoint::get_id(temp_offset_endpoint);
            ESP_LOGI(TAG, "SCD40 Temp Offset control created with id %u (initial: %.2f°C, level %u)",
                     scd40_temp_offset_endpoint_id, loaded_temp_offset_celsius, temp_offset_level);
        }

        ESP_LOGI(TAG, "All SCD40 control endpoints created successfully");

    } else {
        ESP_LOGW(TAG, "SCD40 sensor not available - skipping sensor endpoints creation");
    }

    ESP_LOGI(TAG, "All Matter endpoints created successfully");

    // Setup reset button handler
    app_reset_button_register(app_reset_to_factory);

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    // Set OpenThread platform config
    esp_openthread_platform_config_t config = {
        .radio_config = ESP_OPENTHREAD_DEFAULT_RADIO_CONFIG(),
        .host_config = ESP_OPENTHREAD_DEFAULT_HOST_CONFIG(),
        .port_config = ESP_OPENTHREAD_DEFAULT_PORT_CONFIG(),
    };
    set_openthread_platform_config(&config);
#endif

    // Start Matter
    err = esp_matter::start(app_event_cb);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Matter start failed: %s", esp_err_to_name(err));
        return;
    }

    ESP_LOGI(TAG, "Matter started successfully");

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    // Print Thread network status
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "   THREAD NETWORK STATUS");
    ESP_LOGI(TAG, "====================================");

    auto & threadStackMgr = chip::DeviceLayer::ThreadStackMgr();
    bool isThreadProvisioned = threadStackMgr.IsThreadProvisioned();
    bool isThreadEnabled = threadStackMgr.IsThreadEnabled();
    bool isThreadAttached = threadStackMgr.IsThreadAttached();

    ESP_LOGI(TAG, "Thread Provisioned: %s", isThreadProvisioned ? "YES" : "NO");
    ESP_LOGI(TAG, "Thread Enabled: %s", isThreadEnabled ? "YES" : "NO");
    ESP_LOGI(TAG, "Thread Attached: %s", isThreadAttached ? "YES" : "NO");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "");
#endif

    // Print commissioning information (QR code and manual pairing code)
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "   COMMISSIONING INFORMATION");
    ESP_LOGI(TAG, "====================================");
    PrintOnboardingCodes(chip::RendezvousInformationFlag::kBLE);
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "");

    // Show commissioning info on OLED
    if (oled_available) {
        oled_show_commissioning_info(
            CHIP_DEVICE_CONFIG_USE_TEST_SETUP_PIN_CODE,
            CHIP_DEVICE_CONFIG_USE_TEST_SETUP_DISCRIMINATOR
        );
    }

    // Guards scd40_co2/scd40_temperature/scd40_humidity, shared between
    // scd40_sensor_task (writer) and display_rotation_task (reader).
    scd40_data_mutex = xSemaphoreCreateMutex();
    if (!scd40_data_mutex) {
        ESP_LOGE(TAG, "Failed to create scd40_data_mutex");
    }

    // Start GPIO input monitoring task
    xTaskCreate(gpio_input_task, "gpio_input", 4096, NULL, 5, NULL);

    // Start SCD40 sensor reading task
    xTaskCreate(scd40_sensor_task, "scd40_sensor", 4096, NULL, 5, NULL);

    // Start display rotation task (redraws OLED independently of the 5s SCD40
    // read cycle, to animate the rotating Temp/Humidity/CO2 big-value display)
    if (oled_available) {
        xTaskCreate(display_rotation_task, "display_rotation", 4096, NULL, 5, NULL);
    }

    // Start SCD40 configuration sync task (delayed 10s to ensure Matter connection)
    if (scd40_available) {
        xTaskCreate(scd40_config_sync_task, "scd40_sync", 4096, NULL, 5, NULL);
    }

