massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/main/app_main.cpp
#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    // Start Thread status LED monitoring task
    xTaskCreate(thread_status_led_task, "thread_led", 4096, NULL, 5, NULL);
#endif

    // Mark initialization as complete - now allow Matter attribute updates
    // This prevents the SDK from overwriting EEPROM values during startup
    device_initialization_complete = true;
    ESP_LOGI(TAG, "Device initialization complete - ready for operation");

    // Initialize SNTP for time synchronization (local server only)
    ESP_LOGI(TAG, "Starting SNTP with local server: %s", CONFIG_LOCAL_NTP_SERVER_IPV6);
    sntp_init_local();

    // Start SNTP monitoring task for automatic retry
    xTaskCreate(sntp_monitor_task, "sntp_monitor", 4096, NULL, 5, NULL);

    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "ESP32C6 Matter Device Started");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "Configuration:");
    ESP_LOGI(TAG, "  - 4 Input Sensors: GPIO 0,1,2,21");
    ESP_LOGI(TAG, "  - 2 Output Controls: GPIO 19,20");
    ESP_LOGI(TAG, "  - SCD40 Sensor: I2C (SDA=GPIO22, SCL=GPIO23)");
    ESP_LOGI(TAG, "    * CO2 (ppm)");
    ESP_LOGI(TAG, "    * Temperature (°C)");
    ESP_LOGI(TAG, "    * Humidity (%%RH)");
    ESP_LOGI(TAG, "  - Status LED: GPIO 15 (Thread role indicator)");
    ESP_LOGI(TAG, "  - Protocol: Matter over Thread");
    ESP_LOGI(TAG, "  - NTP Server: %s (local only)", CONFIG_LOCAL_NTP_SERVER_IPV6);
    ESP_LOGI(TAG, "  - Timezone: Europe/Rome (CET/CEST)");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "");
}
